Revit 2026 API

# SchemaCommonDescription Property

---

The property labeled "Description" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string Description { get; }
```
```vb
Public Shared ReadOnly Property Description As String
	Get
```
```cpp
public:
static property String^ Description {
	String^ get ();
}
```
```fsharp
static member Description : string with get
```

#### Property Value

String

This property is of type "AssetPropertyString".

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace